---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningDoesnotCutHost
source: html/0add2435-9791-aec8-0c0d-4c3d3b82ada5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpeningDoesnotCutHost Property

Opening does not cut its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId OpeningDoesnotCutHost { get; }
```